TTEM.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-14 Sat 12:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Theory and Technique of Electronic Music Exercises in Ad Libitum</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ruslan Prakapchuk" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">The Theory and Technique of Electronic Music Exercises in Ad Libitum</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2c58c2c">1. Sinusoids, amplitude and frequency</a>
<ul>
<li><a href="#orgb39f8d7">1.1. Measures of Amplitude</a></li>
<li><a href="#orgec8f17f">1.2. Units of Amplitude</a></li>
<li><a href="#orgfca2211">1.3. Controlling Amplitude</a></li>
<li><a href="#orge6d1f4a">1.4. Frequency</a></li>
<li><a href="#org6433321">1.5. Synthesizing a sinusoid</a></li>
<li><a href="#orgd92eaa7">1.6. Superposing Signals</a></li>
<li><a href="#org4a2bfbc">1.7. Periodic Signals</a></li>
<li><a href="#org6981746">1.8. About the Software Examples</a></li>
<li><a href="#orga2a738e">1.9. Examples</a></li>
<li><a href="#org71ce93e">1.10. Exercises</a></li>
</ul>
</li>
<li><a href="#org4aca7ae">2. Wavetables and samplers</a>
<ul>
<li><a href="#orgf181efc">2.1. The Wavetable Oscillator</a></li>
<li><a href="#org5bfac7d">2.2. Sampling</a></li>
<li><a href="#org7bed29e">2.3. Enveloping samplers</a></li>
<li><a href="#org62bbc70">2.4. Timbre stretching</a></li>
<li><a href="#orgb127768">2.5. Interpolation</a></li>
<li><a href="#org2653937">2.6. Examples</a></li>
<li><a href="#org1d99557">2.7. Exercises</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
It's my exercise book for studying "The Theory and Technique of Electronic
Music" by Miller Puckette. Work is done in Ad Libitum instead of PureData, and
some pieces of code migrate back to Ad Libitum standard library.
</p>

<div id="outline-container-org2c58c2c" class="outline-2">
<h2 id="org2c58c2c"><span class="section-number-2">1</span> Sinusoids, amplitude and frequency</h2>
<div class="outline-text-2" id="text-1">
<p>
Ad Libitum deals with continous representation of time, it's expressed as a
float number of seconds passed from the stream start. For any signal either
continous or discrete feels more natural, and there is no clear measure of
their shares. Good news that conversion is relatively easy in both directions.
</p>

<p>
<code>~&lt;</code> is a syntax sugar which wraps code into function of two parameters:
<code>time</code> and <code>channel</code>, which are thrown in scope. Such kind of function is how
Ad Libitum represents audio signals. Think about time as a continuous
counterpart of sample number <code>n</code> in TTEM. <code>channel</code> will be discussed later.
Think about <code>~&lt;</code> as the thing which animates your formula to produce signal.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #BFEBBF;">(</span><span style="color: #93E0E3;">sinusoid</span> a &#969; &#966;<span style="color: #BFEBBF;">)</span> <span style="color: #BFEBBF;">(</span>~&lt; <span style="color: #D0BF8F;">(</span>* a <span style="color: #93E0E3;">(</span>cos <span style="color: #9FC59F;">(</span>+ <span style="color: #94BFF3;">(</span>* &#969; time<span style="color: #94BFF3;">)</span> &#966;<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
<code>play!</code> connects your signal to audio output and you can hear it! Amplitude
range in Ad Libitum is [-1, 1], setting a=0.2 we are producing signal in 1/5
of it.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span>play! <span style="color: #BFEBBF;">(</span>sinusoid <span style="color: #BFEBBF;">0.2</span> <span style="color: #BFEBBF;">2000.0</span> <span style="color: #BFEBBF;">0.0</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
And the most important function in Ad Libitum — <code>h!</code> hush!
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span>h!<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Let's make sinusoid to receive regular frequency instead of angular one.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #BFEBBF;">(</span><span style="color: #93E0E3;">&#402;</span>&#8594;&#969; &#402;<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>* <span style="color: #BFEBBF;">2&#960;</span> &#402;<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #BFEBBF;">(</span><span style="color: #93E0E3;">&#969;</span>&#8594;&#402; &#969;<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>/ &#969; <span style="color: #BFEBBF;">2&#960;</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #BFEBBF;">(</span><span style="color: #93E0E3;">sinusoid</span> a &#402; &#966;<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>~&lt; <span style="color: #D0BF8F;">(</span>* a <span style="color: #93E0E3;">(</span>cos <span style="color: #9FC59F;">(</span>+ <span style="color: #94BFF3;">(</span>* <span style="color: #E0CF9F;">(</span>&#402;&#8594;&#969; &#402;<span style="color: #E0CF9F;">)</span> time<span style="color: #94BFF3;">)</span> &#966;<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>play! <span style="color: #BFEBBF;">(</span>sinusoid <span style="color: #BFEBBF;">0.2</span> <span style="color: #BFEBBF;">440.0</span> <span style="color: #BFEBBF;">0.0</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>h!<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
