TTEM.html

<div id="outline-container-orgb39f8d7" class="outline-3">
<h3 id="orgb39f8d7"><span class="section-number-3">1.1</span> Measures of Amplitude</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This is not a blood pact, but many of Ad Libitum code relies on fact that
audiosignal is called sample by sample, without skips. Making that assumption
we are able to write RMS amplitude measurement even in continuous
representation of time.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #BFEBBF;">(</span><span style="color: #93E0E3;">rms-amplitude</span> window-width s<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">[</span>windows <span style="color: #9FC59F;">(</span>make-vector *channels*<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">]</span>
        <span style="color: #93E0E3;">[</span>N <span style="color: #9FC59F;">(</span>-&gt; window-width <span style="color: #94BFF3;">(</span>* *sample-rate*<span style="color: #94BFF3;">)</span> <span style="color: #94BFF3;">(</span>ceiling<span style="color: #94BFF3;">)</span> <span style="color: #94BFF3;">(</span>exact<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">]</span>
        <span style="color: #93E0E3;">[</span>cursor -1<span style="color: #93E0E3;">]</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>do-ec <span style="color: #93E0E3;">(</span>: i *channels*<span style="color: #93E0E3;">)</span>
           <span style="color: #93E0E3;">(</span>vector-set! windows i <span style="color: #9FC59F;">(</span>make-vector N <span style="color: #BFEBBF;">0.0</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>~&lt;
     <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #9FC59F;">(</span>zero? channel<span style="color: #9FC59F;">)</span>
       <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">set!</span> cursor <span style="color: #94BFF3;">(</span>mod <span style="color: #E0CF9F;">(</span>+ cursor <span style="color: #BFEBBF;">1</span><span style="color: #E0CF9F;">)</span> N<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
     <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #9FC59F;">(</span><span style="color: #94BFF3;">[</span>window <span style="color: #E0CF9F;">(</span>vector-ref windows channel<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">]</span>
           <span style="color: #94BFF3;">[</span>x <span style="color: #BFEBBF;">0.0</span><span style="color: #94BFF3;">]</span><span style="color: #9FC59F;">)</span>
       <span style="color: #9FC59F;">(</span>vector-set! window cursor <span style="color: #94BFF3;">(</span>&lt;~ s<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
       <span style="color: #9FC59F;">(</span>vector-for-each <span style="color: #94BFF3;">(</span><span style="color: #F0DFAF; font-weight: bold;">&#955;</span> <span style="color: #E0CF9F;">(</span>y<span style="color: #E0CF9F;">)</span> <span style="color: #E0CF9F;">(</span><span style="color: #F0DFAF; font-weight: bold;">set!</span> x <span style="color: #8FB28F;">(</span>+ x <span style="color: #6CA0A3;">(</span>* y y<span style="color: #6CA0A3;">)</span><span style="color: #8FB28F;">)</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span> window<span style="color: #9FC59F;">)</span>
       <span style="color: #9FC59F;">(</span>/ x N<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Let's make sinusoid amplitude a signal, and set it to rms amplitude measured
from sinusoid with peak amplitude 1.0
Note <code>&lt;~</code> syntax sugar to apply audiosignal function to time and channel.
<code>(&lt;~ a)</code> is equivalent to <code>(a time channel)</code>
Also note how we make constant signal with <code>(~&lt; 1.0)</code>
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #BFEBBF;">(</span><span style="color: #93E0E3;">sinusoid</span> a &#402; &#966;<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>~&lt; <span style="color: #D0BF8F;">(</span>* <span style="color: #93E0E3;">(</span>&lt;~ a<span style="color: #93E0E3;">)</span> <span style="color: #93E0E3;">(</span>cos <span style="color: #9FC59F;">(</span>+ <span style="color: #94BFF3;">(</span>* <span style="color: #E0CF9F;">(</span>&#402;&#8594;&#969; &#402;<span style="color: #E0CF9F;">)</span> time<span style="color: #94BFF3;">)</span> &#966;<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Note that computing rms in realtime is very expensive.
Try to increase window width until you get audio buffer underflow glitches.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span>play! <span style="color: #BFEBBF;">(</span>sinusoid <span style="color: #D0BF8F;">(</span>rms-amplitude <span style="color: #BFEBBF;">2/440</span> <span style="color: #93E0E3;">(</span>sinusoid <span style="color: #9FC59F;">(</span>~&lt; <span style="color: #BFEBBF;">1.0</span><span style="color: #9FC59F;">)</span> <span style="color: #BFEBBF;">440.0</span> <span style="color: #BFEBBF;">0.0</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span> <span style="color: #BFEBBF;">440.0</span> <span style="color: #BFEBBF;">0.0</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>h!<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Compare with 1.0 peak itself, it's louder!
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span>play! <span style="color: #BFEBBF;">(</span>sinusoid <span style="color: #D0BF8F;">(</span>~&lt; <span style="color: #BFEBBF;">1.0</span><span style="color: #D0BF8F;">)</span> <span style="color: #BFEBBF;">440.0</span> <span style="color: #BFEBBF;">0.0</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>h!<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Let's throttle <code>rms-amplitude</code> to make it less hungry
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #BFEBBF;">(</span><span style="color: #93E0E3;">rms-amplitude</span> window-width s<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">[</span>windows <span style="color: #9FC59F;">(</span>make-vector *channels*<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">]</span>
        <span style="color: #93E0E3;">[</span>N <span style="color: #9FC59F;">(</span>-&gt; window-width <span style="color: #94BFF3;">(</span>* *sample-rate*<span style="color: #94BFF3;">)</span> <span style="color: #94BFF3;">(</span>ceiling<span style="color: #94BFF3;">)</span> <span style="color: #94BFF3;">(</span>exact<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">]</span>
        <span style="color: #93E0E3;">[</span>cursor -1<span style="color: #93E0E3;">]</span>
        <span style="color: #93E0E3;">[</span>amplitudes <span style="color: #9FC59F;">(</span>make-vector *channels* <span style="color: #BFEBBF;">0.0</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">]</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>do-ec <span style="color: #93E0E3;">(</span>: i *channels*<span style="color: #93E0E3;">)</span>
           <span style="color: #93E0E3;">(</span>vector-set! windows i <span style="color: #9FC59F;">(</span>make-vector N <span style="color: #BFEBBF;">0.0</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>~&lt;
     <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #9FC59F;">(</span>zero? channel<span style="color: #9FC59F;">)</span>
       <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">set!</span> cursor <span style="color: #94BFF3;">(</span>mod <span style="color: #E0CF9F;">(</span>+ cursor <span style="color: #BFEBBF;">1</span><span style="color: #E0CF9F;">)</span> N<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
     <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #9FC59F;">(</span><span style="color: #94BFF3;">[</span>window <span style="color: #E0CF9F;">(</span>vector-ref windows channel<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">]</span><span style="color: #9FC59F;">)</span>
       <span style="color: #9FC59F;">(</span>vector-set! window cursor <span style="color: #94BFF3;">(</span>&lt;~ s<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
       <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #94BFF3;">(</span>zero? cursor<span style="color: #94BFF3;">)</span>
         <span style="color: #94BFF3;">(</span>vector-set!
          amplitudes
          channel
          <span style="color: #E0CF9F;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #8FB28F;">(</span><span style="color: #6CA0A3;">[</span>x <span style="color: #BFEBBF;">0.0</span><span style="color: #6CA0A3;">]</span><span style="color: #8FB28F;">)</span>
            <span style="color: #8FB28F;">(</span>vector-for-each <span style="color: #6CA0A3;">(</span><span style="color: #F0DFAF; font-weight: bold;">&#955;</span> <span style="color: #DCDCCC;">(</span>y<span style="color: #DCDCCC;">)</span> <span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">set!</span> x <span style="color: #BFEBBF;">(</span>+ x <span style="color: #D0BF8F;">(</span>* y y<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span><span style="color: #6CA0A3;">)</span> window<span style="color: #8FB28F;">)</span>
            <span style="color: #8FB28F;">(</span>/ x N<span style="color: #8FB28F;">)</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
     <span style="color: #93E0E3;">(</span>vector-ref amplitudes channel<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>play! <span style="color: #BFEBBF;">(</span>sinusoid <span style="color: #D0BF8F;">(</span>rms-amplitude <span style="color: #BFEBBF;">1</span> <span style="color: #93E0E3;">(</span>+~ <span style="color: #9FC59F;">(</span>sinusoid <span style="color: #94BFF3;">(</span>~&lt; <span style="color: #BFEBBF;">1.0</span><span style="color: #94BFF3;">)</span> <span style="color: #BFEBBF;">440.0</span> <span style="color: #BFEBBF;">0.0</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span> <span style="color: #BFEBBF;">440.0</span> <span style="color: #BFEBBF;">0.0</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>h!<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Chez Scheme Gℂ is so cool that though we produce a lot of garbage every
second it doesn't interrupt sound! But we still have a noticeable lag on
window initialization. Take it into account if you are going to spawn
capacitive <code>rms-amplitude</code> signals frequently.
</p>

<p>
In future for sinusoid we will use built-in Ad Libitum oscillator available
as <code>osc:sine</code> (takes phasor signal as input, we'll cover it later) and
<code>osc:sine///</code> (takes frequency and optional initial phase).
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span>play! <span style="color: #BFEBBF;">(</span>osc:sine/// <span style="color: #BFEBBF;">440.0</span> <span style="color: #BFEBBF;">0.0</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>h!<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
