TTEM.html

<div id="outline-container-orgec8f17f" class="outline-3">
<h3 id="orgec8f17f"><span class="section-number-3">1.2</span> Units of Amplitude</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Convert amplitude to decibels, with a0 = 1e-5 as suggested in TTEM
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #BFEBBF;">(</span><span style="color: #93E0E3;">amp-&gt;dB</span> x<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>* <span style="color: #BFEBBF;">20.0</span> <span style="color: #D0BF8F;">(</span>log <span style="color: #93E0E3;">(</span>* x <span style="color: #BFEBBF;">1e5</span><span style="color: #93E0E3;">)</span> <span style="color: #BFEBBF;">10.0</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>amp-&gt;dB <span style="color: #BFEBBF;">1.0</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>amp-&gt;dB <span style="color: #BFEBBF;">0.5</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
But setting a0 to 1.0 is also very convenient — maximum amplitude is then 0dB
and any one below is just negative. All relations stays the same.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #BFEBBF;">(</span><span style="color: #93E0E3;">amp-&gt;dB</span> x<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>* <span style="color: #BFEBBF;">20.0</span> <span style="color: #D0BF8F;">(</span>log x <span style="color: #BFEBBF;">10.0</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>amp-&gt;dB <span style="color: #BFEBBF;">0.5</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>amp-&gt;dB <span style="color: #BFEBBF;">1e-5</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
And convert decibels back to amplitude:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #BFEBBF;">(</span><span style="color: #93E0E3;">dB-&gt;amp</span> x<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>expt <span style="color: #BFEBBF;">10.0</span> <span style="color: #D0BF8F;">(</span>/ x <span style="color: #BFEBBF;">20.0</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>dB-&gt;amp -100.0<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>dB-&gt;amp -50.0<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>dB-&gt;amp -10.0<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>dB-&gt;amp <span style="color: #BFEBBF;">0.0</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Amplitude is related in an inexact way to the perceived loudness of a sound.
In general, two signals with the same peak or RMS amplitude won’t necessarily
have the same loudness at all. But amplifying a signal by 3 dB, say, will
fairly reliably make it sound about one “step” louder.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #93E0E3;">*volume-step-dB*</span> <span style="color: #BFEBBF;">3.0</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Let's test it!
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #BFEBBF;">(</span><span style="color: #93E0E3;">sinusoid</span> a &#402; &#966;<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>~&lt; <span style="color: #D0BF8F;">(</span>* a <span style="color: #93E0E3;">(</span>cos <span style="color: #9FC59F;">(</span>+ <span style="color: #94BFF3;">(</span>* <span style="color: #E0CF9F;">(</span>&#402;&#8594;&#969; &#402;<span style="color: #E0CF9F;">)</span> time<span style="color: #94BFF3;">)</span> &#966;<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>play! <span style="color: #BFEBBF;">(</span>sinusoid <span style="color: #D0BF8F;">(</span>dB-&gt;amp -10.0<span style="color: #D0BF8F;">)</span> <span style="color: #BFEBBF;">440.0</span> <span style="color: #BFEBBF;">0.0</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>play! <span style="color: #BFEBBF;">(</span>sinusoid <span style="color: #D0BF8F;">(</span>dB-&gt;amp <span style="color: #93E0E3;">(</span>- <span style="color: #BFEBBF;">10.0</span> *volume-step-dB*<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span> <span style="color: #BFEBBF;">440.0</span> <span style="color: #BFEBBF;">0.0</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>h!<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Try to change step. For that wave personally I hear 2dB difference.
</p>
</div>
</div>

<div id="outline-container-orgfca2211" class="outline-3">
<h3 id="orgfca2211"><span class="section-number-3">1.3</span> Controlling Amplitude</h3>
<div class="outline-text-3" id="text-1-3">
<p>
We already controlled amplitude by multiplying every sample by <code>a</code>
Let's do it by multiplying sinusoid by constant signal.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span>play! <span style="color: #BFEBBF;">(</span>*~ <span style="color: #D0BF8F;">(</span>~&lt; <span style="color: #BFEBBF;">0.5</span><span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>osc:sine/// <span style="color: #BFEBBF;">440.0</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>play! <span style="color: #BFEBBF;">(</span>*~ <span style="color: #D0BF8F;">(</span>~&lt; <span style="color: #BFEBBF;">0.2</span><span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>osc:sine/// <span style="color: #BFEBBF;">440.0</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>h!<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge6d1f4a" class="outline-3">
<h3 id="orge6d1f4a"><span class="section-number-3">1.4</span> Frequency</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #BFEBBF;">(</span><span style="color: #93E0E3;">midi-pitch-&gt;frequency</span> m<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>* <span style="color: #BFEBBF;">440.0</span> <span style="color: #D0BF8F;">(</span>expt <span style="color: #BFEBBF;">2.0</span> <span style="color: #93E0E3;">(</span>/ <span style="color: #9FC59F;">(</span>- m <span style="color: #BFEBBF;">69.0</span><span style="color: #9FC59F;">)</span> <span style="color: #BFEBBF;">12.0</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #BFEBBF;">(</span><span style="color: #93E0E3;">frequency-&gt;midi-pitch</span> f<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>+ <span style="color: #BFEBBF;">69</span> <span style="color: #D0BF8F;">(</span>exact <span style="color: #93E0E3;">(</span>round <span style="color: #9FC59F;">(</span>* <span style="color: #BFEBBF;">12.0</span> <span style="color: #94BFF3;">(</span>log <span style="color: #E0CF9F;">(</span>/ f <span style="color: #BFEBBF;">440.0</span><span style="color: #E0CF9F;">)</span> <span style="color: #BFEBBF;">2.0</span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>play! <span style="color: #BFEBBF;">(</span>osc:sine/// <span style="color: #D0BF8F;">(</span>midi-pitch-&gt;frequency <span style="color: #BFEBBF;">69</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>play! <span style="color: #BFEBBF;">(</span>osc:sine/// <span style="color: #D0BF8F;">(</span>midi-pitch-&gt;frequency <span style="color: #BFEBBF;">72</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>h!<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Ad Libitum allows you to use MIDI controller. Support is still incomplete and
relies on many assumptions. Your MIDI input device should be connected and
identified as the first one.
<code>now</code> is Ad Libitum clock function. It's required for MIDI module to put
proper timestamps on events.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span>midi:start now<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Let's defined so called control signal for our frequency. We'll speak about
control signals later, but putting it simply, control signal is an audio
signal which is updated in non-audio rate by calling its setter.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define-values</span> <span style="color: #BFEBBF;">(</span>frequency set-frequency!<span style="color: #BFEBBF;">)</span> <span style="color: #BFEBBF;">(</span>control-signal id <span style="color: #BFEBBF;">440.0</span> instant-transition<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Let's set callback which will be called for every control change MIDI event.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span>midi:set-cc! <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">&#955;</span> <span style="color: #D0BF8F;">(</span>t knob value channel<span style="color: #D0BF8F;">)</span>
                <span style="color: #D0BF8F;">(</span>set-frequency! <span style="color: #93E0E3;">(</span>midi-pitch-&gt;frequency value<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>play! <span style="color: #BFEBBF;">(</span>osc:sine/// frequency<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>h!<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Notice that abrupt change of frequency cause "pops" discussed in TTEM 1.5
</p>
</div>
</div>
