TTEM.org
** Synthesizing a sinusoid

   To make transition smooth we could use built-in *linear-transition*

#+BEGIN_SRC scheme
  (define-values (frequency set-frequency!) (control-signal id 440.0 *linear-transition*))
#+END_SRC

   Besides of using MIDI input we could make frequency change programmatically.
   =schedule= allows you to call any function later at given point of time.
   Any function could schedule itself. It is called temporal recursion.

#+BEGIN_SRC scheme
  (define (swap-frequency i)
    (if (zero? i)
        (set-frequency! 440.0)
        (set-frequency! 220.0))
    (schedule (+ (now) 1/4) 'swap-frequency (- 1 i)))

  (swap-frequency 0)

  (play! (osc:sine/// frequency))
  (h!)
#+END_SRC

** Superposing Signals
** Periodic Signals
** About the Software Examples
** Examples
** Exercises

* Wavetables and samplers

** The Wavetable Oscillator
** Sampling
** Enveloping samplers
** Timbre stretching
** Interpolation
** Examples
** Exercises
