TTEM.html

<div id="outline-container-org6433321" class="outline-3">
<h3 id="org6433321"><span class="section-number-3">1.5</span> Synthesizing a sinusoid</h3>
<div class="outline-text-3" id="text-1-5">
<p>
To make transition smooth we could use built-in <b>linear-transition</b>
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define-values</span> <span style="color: #BFEBBF;">(</span>frequency set-frequency!<span style="color: #BFEBBF;">)</span> <span style="color: #BFEBBF;">(</span>control-signal id <span style="color: #BFEBBF;">440.0</span> *linear-transition*<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Besides of using MIDI input we could make frequency change programmatically.
<code>schedule</code> allows you to call any function later at given point of time.
Any function could schedule itself. It is called temporal recursion.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #BFEBBF;">(</span><span style="color: #93E0E3;">swap-frequency</span> i<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #D0BF8F;">(</span>zero? i<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>set-frequency! <span style="color: #BFEBBF;">440.0</span><span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>set-frequency! <span style="color: #BFEBBF;">220.0</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>schedule <span style="color: #D0BF8F;">(</span>+ <span style="color: #93E0E3;">(</span>now<span style="color: #93E0E3;">)</span> <span style="color: #BFEBBF;">1/4</span><span style="color: #D0BF8F;">)</span> 'swap-frequency <span style="color: #D0BF8F;">(</span>- <span style="color: #BFEBBF;">1</span> i<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>swap-frequency <span style="color: #BFEBBF;">0</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>play! <span style="color: #BFEBBF;">(</span>osc:sine/// frequency<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>h!<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd92eaa7" class="outline-3">
<h3 id="orgd92eaa7"><span class="section-number-3">1.6</span> Superposing Signals</h3>
</div>
<div id="outline-container-org4a2bfbc" class="outline-3">
<h3 id="org4a2bfbc"><span class="section-number-3">1.7</span> Periodic Signals</h3>
</div>
<div id="outline-container-org6981746" class="outline-3">
<h3 id="org6981746"><span class="section-number-3">1.8</span> About the Software Examples</h3>
</div>
<div id="outline-container-orga2a738e" class="outline-3">
<h3 id="orga2a738e"><span class="section-number-3">1.9</span> Examples</h3>
</div>
<div id="outline-container-org71ce93e" class="outline-3">
<h3 id="org71ce93e"><span class="section-number-3">1.10</span> Exercises</h3>
</div>
</div>

<div id="outline-container-org4aca7ae" class="outline-2">
<h2 id="org4aca7ae"><span class="section-number-2">2</span> Wavetables and samplers</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf181efc" class="outline-3">
<h3 id="orgf181efc"><span class="section-number-3">2.1</span> The Wavetable Oscillator</h3>
</div>
<div id="outline-container-org5bfac7d" class="outline-3">
<h3 id="org5bfac7d"><span class="section-number-3">2.2</span> Sampling</h3>
</div>
<div id="outline-container-org7bed29e" class="outline-3">
<h3 id="org7bed29e"><span class="section-number-3">2.3</span> Enveloping samplers</h3>
</div>
<div id="outline-container-org62bbc70" class="outline-3">
<h3 id="org62bbc70"><span class="section-number-3">2.4</span> Timbre stretching</h3>
</div>
<div id="outline-container-orgb127768" class="outline-3">
<h3 id="orgb127768"><span class="section-number-3">2.5</span> Interpolation</h3>
</div>
<div id="outline-container-org2653937" class="outline-3">
<h3 id="org2653937"><span class="section-number-3">2.6</span> Examples</h3>
</div>
<div id="outline-container-org1d99557" class="outline-3">
<h3 id="org1d99557"><span class="section-number-3">2.7</span> Exercises</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ruslan Prakapchuk</p>
<p class="date">Created: 2017-10-14 Sat 12:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
